PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_sar_v1_1.h
/* SAR_HS_CAL_MEM.CALCTRL */
#define SAR_HS_CAL_MEM_CALCTRL_OFFDEP_Pos       0UL
#define SAR_HS_CAL_MEM_CALCTRL_OFFDEP_Msk       0x1UL
#define SAR_HS_CAL_MEM_CALCTRL_R1_Pos           1UL
#define SAR_HS_CAL_MEM_CALCTRL_R1_Msk           0xFEUL
#define SAR_HS_CAL_MEM_CALCTRL_AVG_Pos          8UL
#define SAR_HS_CAL_MEM_CALCTRL_AVG_Msk          0x300UL
#define SAR_HS_CAL_MEM_CALCTRL_STC_Pos          10UL
#define SAR_HS_CAL_MEM_CALCTRL_STC_Msk          0xC00UL
#define SAR_HS_CAL_MEM_CALCTRL_R12_Pos          12UL
#define SAR_HS_CAL_MEM_CALCTRL_R12_Msk          0xFFFFF000UL
/* SAR_HS_CAL_MEM.CONVCTRL */
#define SAR_HS_CAL_MEM_CONVCTRL_INIT_TC_Pos     0UL
#define SAR_HS_CAL_MEM_CONVCTRL_INIT_TC_Msk     0x3UL
#define SAR_HS_CAL_MEM_CONVCTRL_R2_Pos          2UL
#define SAR_HS_CAL_MEM_CONVCTRL_R2_Msk          0xCUL
#define SAR_HS_CAL_MEM_CONVCTRL_MSB_CTRL_Pos    4UL
#define SAR_HS_CAL_MEM_CONVCTRL_MSB_CTRL_Msk    0x10UL
#define SAR_HS_CAL_MEM_CONVCTRL_RES_RAW_Pos     5UL
#define SAR_HS_CAL_MEM_CONVCTRL_RES_RAW_Msk     0x20UL
#define SAR_HS_CAL_MEM_CONVCTRL_R6_Pos          6UL
#define SAR_HS_CAL_MEM_CONVCTRL_R6_Msk          0xFFFFFFC0UL
/* SAR_HS_CAL_MEM.ADFTMUX */
#define SAR_HS_CAL_MEM_ADFTMUX_EN_Pos           0UL
#define SAR_HS_CAL_MEM_ADFTMUX_EN_Msk           0x1UL
#define SAR_HS_CAL_MEM_ADFTMUX_SEL_Pos          1UL
#define SAR_HS_CAL_MEM_ADFTMUX_SEL_Msk          0x1EUL
#define SAR_HS_CAL_MEM_ADFTMUX_R5_Pos           5UL
#define SAR_HS_CAL_MEM_ADFTMUX_R5_Msk           0xFFFFFFE0UL
/* SAR_HS_CAL_MEM.CALMEM0 */
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT9_Pos      0UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT9_Msk      0x3FUL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT10_Pos     6UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT10_Msk     0xFC0UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT11_Pos     12UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT11_Msk     0x3F000UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT12_Pos     18UL
#define SAR_HS_CAL_MEM_CALMEM0_LINBIT12_Msk     0x1FC0000UL
#define SAR_HS_CAL_MEM_CALMEM0_OFFSET_Pos       25UL
#define SAR_HS_CAL_MEM_CALMEM0_OFFSET_Msk       0xFE000000UL


/* SAR_LP_CAL_MEM.CALCTRL */
#define SAR_LP_CAL_MEM_CALCTRL_OFFDEP_Pos       0UL
#define SAR_LP_CAL_MEM_CALCTRL_OFFDEP_Msk       0x1UL
#define SAR_LP_CAL_MEM_CALCTRL_R1_Pos           1UL
#define SAR_LP_CAL_MEM_CALCTRL_R1_Msk           0xFEUL
#define SAR_LP_CAL_MEM_CALCTRL_AVG_Pos          8UL
#define SAR_LP_CAL_MEM_CALCTRL_AVG_Msk          0x300UL
#define SAR_LP_CAL_MEM_CALCTRL_STC_Pos          10UL
#define SAR_LP_CAL_MEM_CALCTRL_STC_Msk          0xC00UL
#define SAR_LP_CAL_MEM_CALCTRL_R12_Pos          12UL
#define SAR_LP_CAL_MEM_CALCTRL_R12_Msk          0xFFFFF000UL
/* SAR_LP_CAL_MEM.CONVCTRL */
#define SAR_LP_CAL_MEM_CONVCTRL_R0_Pos          0UL
#define SAR_LP_CAL_MEM_CONVCTRL_R0_Msk          0x1FUL
#define SAR_LP_CAL_MEM_CONVCTRL_RES_RAW_Pos     5UL
#define SAR_LP_CAL_MEM_CONVCTRL_RES_RAW_Msk     0x20UL
#define SAR_LP_CAL_MEM_CONVCTRL_R6_Pos          6UL
#define SAR_LP_CAL_MEM_CONVCTRL_R6_Msk          0xFFFFFFC0UL
/* SAR_LP_CAL_MEM.ADFTMUX */
#define SAR_LP_CAL_MEM_ADFTMUX_EN_Pos           0UL
#define SAR_LP_CAL_MEM_ADFTMUX_EN_Msk           0x1UL
#define SAR_LP_CAL_MEM_ADFTMUX_SEL_Pos          1UL
#define SAR_LP_CAL_MEM_ADFTMUX_SEL_Msk          0x6UL
#define SAR_LP_CAL_MEM_ADFTMUX_R5_Pos           3UL
#define SAR_LP_CAL_MEM_ADFTMUX_R5_Msk           0xFFFFFFF8UL
/* SAR_LP_CAL_MEM.CALMEM0 */
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT9_Pos      0UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT9_Msk      0x3FUL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT10_Pos     6UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT10_Msk     0xFC0UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT11_Pos     12UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT11_Msk     0x3F000UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT12_Pos     18UL
#define SAR_LP_CAL_MEM_CALMEM0_LINBIT12_Msk     0x1FC0000UL
#define SAR_LP_CAL_MEM_CALMEM0_OFFSET_Pos       25UL
#define SAR_LP_CAL_MEM_CALMEM0_OFFSET_Msk       0xFE000000UL


/* SAR_TRIM.BUF0_OFFSET_TRIM */
#define SAR_TRIM_BUF0_OFFSET_TRIM_BUF0_OFFSET_TRIM_Pos 0UL
#define SAR_TRIM_BUF0_OFFSET_TRIM_BUF0_OFFSET_TRIM_Msk 0x3FUL
/* SAR_TRIM.BUF0_SLOPE_OFFSET_TRIM */
#define SAR_TRIM_BUF0_SLOPE_OFFSET_TRIM_BUF0_SLOPE_OFFSET_TRIM_Pos 0UL
#define SAR_TRIM_BUF0_SLOPE_OFFSET_TRIM_BUF0_SLOPE_OFFSET_TRIM_Msk 0x3FUL
/* SAR_TRIM.BUF0_COMP_TRIM */
#define SAR_TRIM_BUF0_COMP_TRIM_BUF0_COMP_TRIM_Pos 0UL
#define SAR_TRIM_BUF0_COMP_TRIM_BUF0_COMP_TRIM_Msk 0xFUL
/* SAR_TRIM.BUF1_OFFSET_TRIM */
#define SAR_TRIM_BUF1_OFFSET_TRIM_BUF1_OFFSET_TRIM_Pos 0UL
#define SAR_TRIM_BUF1_OFFSET_TRIM_BUF1_OFFSET_TRIM_Msk 0x3FUL
/* SAR_TRIM.BUF1_SLOPE_OFFSET_TRIM */
#define SAR_TRIM_BUF1_SLOPE_OFFSET_TRIM_BUF1_SLOPE_OFFSET_TRIM_Pos 0UL
#define SAR_TRIM_BUF1_SLOPE_OFFSET_TRIM_BUF1_SLOPE_OFFSET_TRIM_Msk 0x3FUL
/* SAR_TRIM.BUF1_COMP_TRIM */
#define SAR_TRIM_BUF1_COMP_TRIM_BUF1_COMP_TRIM_Pos 0UL
#define SAR_TRIM_BUF1_COMP_TRIM_BUF1_COMP_TRIM_Msk 0xFUL
/* SAR_TRIM.RMP_TRIM */
#define SAR_TRIM_RMP_TRIM_RMP_TRIM_Pos          0UL
#define SAR_TRIM_RMP_TRIM_RMP_TRIM_Msk          0xFUL
#define SAR_TRIM_RMP_TRIM_TEMP_SENSOR_TRIM_Pos  4UL
#define SAR_TRIM_RMP_TRIM_TEMP_SENSOR_TRIM_Msk  0x10UL


/* SAR.SEQ_HS_DATA */
#define SAR_SEQ_HS_DATA_HS_GPIO_CHAN_EN_Pos     0UL
#define SAR_SEQ_HS_DATA_HS_GPIO_CHAN_EN_Msk     0xFFUL
#define SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL_Pos  8UL
#define SAR_SEQ_HS_DATA_HS_MUX_CHAN_EN_SEL_Msk  0x700UL
#define SAR_SEQ_HS_DATA_RESERVED_0_Pos          11UL
#define SAR_SEQ_HS_DATA_RESERVED_0_Msk          0x800UL
#define SAR_SEQ_HS_DATA_MUX0_CHAN_SEL_Pos       12UL
#define SAR_SEQ_HS_DATA_MUX0_CHAN_SEL_Msk       0xF000UL
#define SAR_SEQ_HS_DATA_MUX1_CHAN_SEL_Pos       16UL
#define SAR_SEQ_HS_DATA_MUX1_CHAN_SEL_Msk       0xF0000UL
#define SAR_SEQ_HS_DATA_SAMPLE_TIME_SEL_Pos     20UL
#define SAR_SEQ_HS_DATA_SAMPLE_TIME_SEL_Msk     0x300000UL
#define SAR_SEQ_HS_DATA_SAMPLE_TIME_EN_Pos      22UL
#define SAR_SEQ_HS_DATA_SAMPLE_TIME_EN_Msk      0x400000UL
#define SAR_SEQ_HS_DATA_TR_SAMPLE_TIME_EN_Pos   23UL
#define SAR_SEQ_HS_DATA_TR_SAMPLE_TIME_EN_Msk   0x800000UL
#define SAR_SEQ_HS_DATA_AVG_CNT_Pos             24UL
#define SAR_SEQ_HS_DATA_AVG_CNT_Msk             0x7000000UL
#define SAR_SEQ_HS_DATA_AVG_EN_Pos              27UL
#define SAR_SEQ_HS_DATA_AVG_EN_Msk              0x8000000UL
#define SAR_SEQ_HS_DATA_CALIBRATE_Pos           28UL
#define SAR_SEQ_HS_DATA_CALIBRATE_Msk           0x30000000UL
#define SAR_SEQ_HS_DATA_NEXT_ACTION_Pos         30UL
#define SAR_SEQ_HS_DATA_NEXT_ACTION_Msk         0xC0000000UL
/* SAR.SEQ_LP_DATA */
#define SAR_SEQ_LP_DATA_LP_CHAN_EN_Pos          0UL
#define SAR_SEQ_LP_DATA_LP_CHAN_EN_Msk          0x1UL
#define SAR_SEQ_LP_DATA_RESERVED_1_Pos          1UL
#define SAR_SEQ_LP_DATA_RESERVED_1_Msk          0xFFEUL
#define SAR_SEQ_LP_DATA_CHAN_SEL_Pos            12UL
#define SAR_SEQ_LP_DATA_CHAN_SEL_Msk            0xF000UL
#define SAR_SEQ_LP_DATA_RESERVED_2_Pos          16UL
#define SAR_SEQ_LP_DATA_RESERVED_2_Msk          0xF0000UL
#define SAR_SEQ_LP_DATA_SAMPLE_TIME_SEL_Pos     20UL
#define SAR_SEQ_LP_DATA_SAMPLE_TIME_SEL_Msk     0x300000UL
#define SAR_SEQ_LP_DATA_SAMPLE_TIME_EN_Pos      22UL
#define SAR_SEQ_LP_DATA_SAMPLE_TIME_EN_Msk      0x400000UL
#define SAR_SEQ_LP_DATA_TR_SAMPLE_TIME_EN_Pos   23UL
#define SAR_SEQ_LP_DATA_TR_SAMPLE_TIME_EN_Msk   0x800000UL
#define SAR_SEQ_LP_DATA_AVG_CNT_Pos             24UL
#define SAR_SEQ_LP_DATA_AVG_CNT_Msk             0x7000000UL
#define SAR_SEQ_LP_DATA_AVG_EN_Pos              27UL
#define SAR_SEQ_LP_DATA_AVG_EN_Msk              0x8000000UL
#define SAR_SEQ_LP_DATA_CALIBRATE_Pos           28UL
#define SAR_SEQ_LP_DATA_CALIBRATE_Msk           0x30000000UL
#define SAR_SEQ_LP_DATA_NEXT_ACTION_Pos         30UL
#define SAR_SEQ_LP_DATA_NEXT_ACTION_Msk         0xC0000000UL


#endif /* _CYIP_SAR_V1_1_H_ */


/* [] END OF FILE */
